Repository: h8t33r/task_appcenter_builder
Catalog: L10n/*.po
Languages: ru

source: PowerShell Builder for Microsoft AppCenter
ru: Сборщик проектов для Microsoft AppCenter

source: Version: 0.4
ru: Версия: 0.4

source: The script starts the application build process in the Microsoft Application Center.
ru: Скрипт запускает процесс сборки приложения в Microsoft Application Center.

source: Script environment: Windows 10 / PowerShell 5.1
ru: Окружения для запуска: Windows 10 / PowerShell 5.1

source: Links
ru: Ссылочки

source: Usage
ru: Использование

source: 1. For more security, the token is now stored in user environment variables. Run register-token.ps1 and enter the 40-character token. Token generated in AppCenter user settings.
ru: 1. Для большей безопасности токен теперь хранится в переменной окружения. Запустите register-token.ps1 и введите 40-символьный токен. Токен генерируется в настройках AppCenter.

source: 2. Enter the Application name in builder.ps1. ```powershell [string] $applicationName = "Example-Application" ``` 3. Run script
ru: 2. Введите имя приложения в builder.ps1. ```powershell [string] $applicationName = "Example-Application" ``` 3. запустите скрипт

source: Documentation
ru: Документация

source: Before Try { } block:
ru: До блока Try { }:

source: 1. Initialize variables
ru: 1. Инициализируйте переменные

source: [string] $apiTokenFA - Full Access Authorize Token
ru: [string] $apiTokenFA - Токен для полного доступа

source: [string] $apiTokenRO - Read Only Authorize Token
ru: [string] $apiTokenRO - Токен для доступа только для чтения

source: [string] $applicationName - Microsoft AppCneter - Application Name
ru: [string] $applicationName - Microsoft AppCneter - Имя приложения

source: [int] $sleepInSeconds - Build ineration checking time in seconds.
ru: [int] $sleepInSeconds - Время в секундах между проверками билда.

source: Also set the pathes for logs and report templates.
ru: Так же определяются пути для логов и шаблон отчета.

source: 2. Functions
ru: 2. Методы

source: Create-Folders { }
ru: Метод Create-Folders { }

source: Check the availability of logs and reports directories . If absent - create it.
ru: Проверяет доступность директорий для записи логов и отчетов. Если недоступны - создает их.

source: Get-API-Response { }
ru: Метод Get-API-Response { }

source: Set AppCenter API root url
ru: Выставить AppCenter API root url

source: Set HTTP Headers varitable
ru: Определяется HTTP заголовок

source: Initiate SSL connection (TLS 1.2)
ru: Инициализация SSL соединения (TLS 1.2)

source: Write the Log
ru: Пишет в лог

source: Set Report file name
ru: Определяем имя отчета

source: Inside Catch { } block
ru: Внутри блока Catch { }

source: To catch exceptions and write to the log.
ru: Отлавливает исключения и записывает в лог.

source: Inside Finally { } block
ru: Внутри блока Finally { }

source: Test md file
ru: Тестовый md файл

source: Hello weblate ```bash mv /etc /tpm ``` - hurr - durr
ru: Привет веблейт ```bash mv /etc /tpm ``` - хурр - дурр
